Autodesk.Revit.DB.DirectShape.IsValidCategoryId(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Document)
Test the category id to make sure the category is allowed for a DirectShape or DirectShapeType.
categoryId:
Category id to be tested.
doc:
Document to look up the category by id.
Returns:
True if the category is allowed for a DirectShape or DirectShapeType, false if not.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015